app/controllers/cats_controller.rb

  def show
    @cat = Cat.find_by_id(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2345], ["LIMIT", 1]]